Revit 2027 API
BuiltInFailures.RebarFailures.RemoveSpliceBetweenBars Property
 Splice cannot be maintained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RemoveSpliceBetweenBars { get; }
Public Shared ReadOnly Property RemoveSpliceBetweenBars As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RemoveSpliceBetweenBars {
	FailureDefinitionId^ get ();
}
static member RemoveSpliceBetweenBars : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace